Revit 2024 API
StructuralInstanceUsage Enumeration
 Represents the structural usage of a family instance.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Since: 2011
Syntax
C#
public enum StructuralInstanceUsage
Visual Basic
Public Enumeration StructuralInstanceUsage
Visual C++
public enum class StructuralInstanceUsage
Members
Member name | Description
Undefined |  indicates automatic
Wall |  Structural usage is as wall.
Column |  Structural usage is as column.
Girder |  Structural usage is as girder.
Joist |  Structural usage is as joist.
Purlin |  Structural usage is as purlin.
Other |  Structural usage is as "other".
Brace |  Structural usage is as brace.
HorizontalBracing |  Structural usage is as horizontal bracing.
KickerBracing |  Structural usage is as kicker bracing.
Automatic |  Structural usage is automatic.
TrussChord |  Structural usage is as truss chord.
TrussWeb |  Structural usage is as truss web.
See Also
Autodesk.Revit.DB.Structure Namespace